Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
#ifndef SAM4SA_H__27_08_2014__11_07
#define SAM4SA_H__27_08_2014__11_07

#ifndef CORETYPE_SAM4SA
#error  Must #include "core.h"
#endif 

#include "types.h"
#include "cm4.h"

//#define MCK 100000000


#ifndef WIN32
#define MK_PTR(n,p)  T_HW::S_##n * const n = ((T_HW::S_##n*)(p))
#else
extern byte core_sys_array[0x100000]; 
#define MK_PTR(n,p)  T_HW::S_##n * const n = ((T_HW::S_##n*)(core_sys_array-0x40000000+p))
#endif

#define MKPID(n,i) n##_M=(1UL<<(i&31)), n##_I=i

#define SUPC_IRQ		0	/**<  0 SAM4SA16B Supply Controller (SUPC) */
#define RSTC_IRQ		1	/**<  1 SAM4SA16B Reset Controller (RSTC) */
#define RTC_IRQ			2	/**<  2 SAM4SA16B Real Time Clock (RTC) */
#define RTT_IRQ			3	/**<  3 SAM4SA16B Real Time Timer (RTT) */
#define WDT_IRQ			4	/**<  4 SAM4SA16B Watchdog Timer (WDT) */
#define PMC_IRQ			5	/**<  5 SAM4SA16B Power Management Controller (PMC) */
#define EFC0_IRQ		6	/**<  6 SAM4SA16B Enhanced Embedded Flash Controller 0 (EFC0) */
#define UART0_IRQ		8	/**<  8 SAM4SA16B UART 0 (UART0) */
#define UART1_IRQ		9	/**<  9 SAM4SA16B UART 1 (UART1) */
#define PIOA_IRQ		11	/**< 11 SAM4SA16B Parallel I/O Controller A (PIOA) */
#define PIOB_IRQ		12	/**< 12 SAM4SA16B Parallel I/O Controller B (PIOB) */
#define USART0_IRQ		14	/**< 14 SAM4SA16B USART 0 (USART0) */
#define USART1_IRQ		15	/**< 15 SAM4SA16B USART 1 (USART1) */
#define HSMCI_IRQ		18	/**< 18 SAM4SA16B Multimedia Card Interface (HSMCI) */
#define TWI0_IRQ		19	/**< 19 SAM4SA16B Two Wire Interface 0 (TWI0) */
#define TWI1_IRQ		20	/**< 20 SAM4SA16B Two Wire Interface 1 (TWI1) */
#define SPI_IRQ			21	/**< 21 SAM4SA16B Serial Peripheral Interface (SPI) */
#define SSC_IRQ			22	/**< 22 SAM4SA16B Synchronous Serial Controller (SSC) */
#define TC0_IRQ			23	/**< 23 SAM4SA16B Timer/Counter 0 (TC0) */
#define TC1_IRQ			24	/**< 24 SAM4SA16B Timer/Counter 1 (TC1) */
#define TC2_IRQ			25	/**< 25 SAM4SA16B Timer/Counter 2 (TC2) */
#define ADC_IRQ			29	/**< 29 SAM4SA16B Analog To Digital Converter (ADC) */
#define DACC_IRQ		30	/**< 30 SAM4SA16B Digital To Analog Converter (DACC) */
#define PWM_IRQ			31	/**< 31 SAM4SA16B Pulse Width Modulation (PWM) */
#define CRCCU_IRQ		32	/**< 32 SAM4SA16B CRC Calculation Unit (CRCCU) */
#define ACC_IRQ			33	/**< 33 SAM4SA16B Analog Comparator (ACC) */
#define UDP_IRQ			34	/**< 34 SAM4SA16B USB Device Port (UDP) */

#pragma anon_unions

namespace T_HW
{
	typedef volatile unsigned int AT91_REG;// Hardware register definition
	typedef volatile void * AT91_PTR;// Hardware register definition

	typedef void(*AT91_IHP)() __irq;	// Interrupt handler pointer

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_SMC
	{
		AT91_REG	NFC_CFG;	
		AT91_REG	NFC_CTRL;	
		AT91_REG	NFC_SR;	
		AT91_REG	NFC_IER;	
		AT91_REG	NFC_IDR;	
		AT91_REG	NFC_IMR;	
		AT91_REG	NFC_ADDR;	
		AT91_REG	NFC_BANK;	
		AT91_REG	ECC_CTRL;	
		AT91_REG	ECC_MD;	
		AT91_REG	ECC_SR1;	
		AT91_REG	ECC_PR0;	
		AT91_REG	ECC_PR1;	
		AT91_REG	ECC_SR2;	
		AT91_REG	ECC_PR2;	
		AT91_REG	ECC_PR3;	
		AT91_REG	ECC_PR4;	
		AT91_REG	ECC_PR5;	
		AT91_REG	ECC_PR6;	
		AT91_REG	ECC_PR7;	
		AT91_REG	ECC_PR8;	
		AT91_REG	ECC_PR9;	
		AT91_REG	ECC_PR10;	
		AT91_REG	ECC_PR11;	
		AT91_REG	ECC_PR12;	
		AT91_REG	ECC_PR13;	
		AT91_REG	ECC_PR14;	
		AT91_REG	ECC_PR15;	

		struct S_CSR { AT91_REG	SETUP, PULSE, CYCLE, TIMINGS, MODE;	} CSR[8];

		AT91_REG	OCMS;	
		AT91_REG	KEY1;	
		AT91_REG	KEY2;	
		AT91_REG	WPCR;	
		AT91_REG	WPSR;	
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_PMC
	{
		AT91_REG	SCER;
		AT91_REG	SCDR;
		AT91_REG	SCSR;
		AT91_REG	z__reserved1;
		AT91_REG	PCER0;
		AT91_REG	PCDR0;
		AT91_REG	PCSR0;
		AT91_REG	z__reserved2;
		AT91_REG	MOR;
		AT91_REG	MCFR;
		AT91_REG	PLLAR;
		AT91_REG	PLLBR;
		AT91_REG	MCKR;
		AT91_REG	z__reserved4;
		AT91_REG	USBCR;
		AT91_REG	z__reserved5;
		AT91_REG	PCK[3];
		AT91_REG	z__reserved6[5];
		AT91_REG	IER;
		AT91_REG	IDR;
		AT91_REG	SR;
		AT91_REG	IMR;
		AT91_REG	FSMR;
		AT91_REG	FSPR;
		AT91_REG	FOCR;
		AT91_REG	z__reserved7[26];
		AT91_REG	WPMR;
		AT91_REG	WPSR;
		AT91_REG	z__reserved8[5];
		AT91_REG	PCER1;
		AT91_REG	PCDR1;
		AT91_REG	PCSR1;
		AT91_REG	z__reserved9;
		AT91_REG	OCR;

		void ClockEnable(byte pid)	{ if (pid < 32) PCER0 = (1UL<<pid); else PCER1 = (1UL<<(pid-32)); }
		void ClockDisable(byte pid)	{ if (pid < 32) PCDR0 = (1UL<<pid); else PCDR1 = (1UL<<(pid-32)); }
	};

	/* -------- CKGR_MOR : (PMC Offset: 0x0020) Main Oscillator Register -------- */

	#define PMC_MOSCXTEN			(0x1u << 0)				/**< \brief (CKGR_MOR) Main Crystal Oscillator Enable */
	#define PMC_MOSCXTBY			(0x1u << 1)				/**< \brief (CKGR_MOR) Main Crystal Oscillator Bypass */
	#define PMC_WAITMODE			(0x1u << 2)				/**< \brief (CKGR_MOR) Wait Mode Command */
	#define PMC_MOSCRCEN			(0x1u << 3)				/**< \brief (CKGR_MOR) Main On-Chip RC Oscillator Enable */
	#define	PMC_MOSCRCF_4_MHz		(0x0u << 4)				/**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 4 MHz (default) */
	#define	PMC_MOSCRCF_8_MHz		(0x1u << 4)				/**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 8 MHz */
	#define	PMC_MOSCRCF_12_MHz		(0x2u << 4)				/**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 12 MHz */
	#define PMC_MOSCXTST_MSK		(0xffu << 8)			/**< \brief (CKGR_MOR) Main Crystal Oscillator Start-up Time */
	#define PMC_MOSCXTST(value)		(((value)&0xFF) << 8)	/**< \brief (CKGR_MOR) Main Crystal Oscillator Start-up Time */
	#define	PMC_KEY_PASSWD			(0x37u << 16)			/**< \brief (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0. */
	#define PMC_MOSCSEL				(0x1u << 24)			/**< \brief (CKGR_MOR) Main Oscillator Selection */
	#define PMC_CFDEN				(0x1u << 25)			/**< \brief (CKGR_MOR) Clock Failure Detector Enable */

	/* -------- PMC_SR : (PMC Offset: 0x0068) Status Register -------- */

	#define PMC_MOSCXTS		(0x1u << 0)		/**< \brief (PMC_SR) Main XTAL Oscillator Status */
	#define PMC_LOCKA		(0x1u << 1)		/**< \brief (PMC_SR) PLLA Lock Status */
	#define PMC_LOCKB		(0x1u << 2)		/**< \brief (PMC_SR) PLLB Lock Status */
	#define PMC_MCKRDY		(0x1u << 3)		/**< \brief (PMC_SR) Master Clock Status */
	#define PMC_OSCSELS		(0x1u << 7)		/**< \brief (PMC_SR) Slow Clock Oscillator Selection */
	#define PMC_PCKRDY0		(0x1u << 8)		/**< \brief (PMC_SR) Programmable Clock Ready Status */
	#define PMC_PCKRDY1		(0x1u << 9)		/**< \brief (PMC_SR) Programmable Clock Ready Status */
	#define PMC_PCKRDY2		(0x1u << 10)	/**< \brief (PMC_SR) Programmable Clock Ready Status */
	#define PMC_MOSCSELS	(0x1u << 16)	/**< \brief (PMC_SR) Main Oscillator Selection Status */
	#define PMC_MOSCRCS		(0x1u << 17)	/**< \brief (PMC_SR) Main On-Chip RC Oscillator Status */
	#define PMC_CFDEV		(0x1u << 18)	/**< \brief (PMC_SR) Clock Failure Detector Event */
	#define PMC_CFDS		(0x1u << 19)	/**< \brief (PMC_SR) Clock Failure Detector Status */
	#define PMC_FOS			(0x1u << 20)	/**< \brief (PMC_SR) Clock Failure Detector Fault Output Status */

