Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	/* -------- CKGR_PLLAR : (PMC Offset: 0x0028) PLLA Register -------- */

	#define PMC_DIVA_MSK			(0xffu << 0)				/**< \brief (CKGR_PLLAR) PLLA Front_End Divider */
	#define PMC_DIVA(value)			(((value)&0xFF) << 0)		/**< \brief (CKGR_PLLAR) PLLA Front_End Divider */
	#define PMC_PLLACOUNT_MSK		(0x3fu << 8)				/**< \brief (CKGR_PLLAR) PLLA Counter */
	#define PMC_PLLACOUNT(value)	(((value)&0x3F) << 8)		/**< \brief (CKGR_PLLAR) PLLA Counter */
	#define PMC_MULA_MSK			(0x7ffu << 16)				/**< \brief (CKGR_PLLAR) PLLA Multiplier */
	#define PMC_MULA(value)			(((value)&0x7FF) << 16)		/**< \brief (CKGR_PLLAR) PLLA Multiplier */
	#define PMC_ONE					(0x1u << 29)				/**< \brief (CKGR_PLLAR) Must Be Set to 1 */

	/* -------- CKGR_PLLBR : (PMC Offset: 0x002C) PLLB Register -------- */
	
	#define PMC_DIVB_MSK			(0xffu << 0)			/**< \brief (CKGR_PLLBR) PLLB Front-End Divider */
	#define PMC_DIVB(value)			(((value)&0xFF) << 0)	/**< \brief (CKGR_PLLBR) PLLB Front-End Divider */
	#define PMC_PLLBCOUNT_MSK		(0x3fu << 8)			/**< \brief (CKGR_PLLBR) PLLB Counter */
	#define PMC_PLLBCOUNT(value)	(((value)&0x3F) << 8)	/**< \brief (CKGR_PLLBR) PLLB Counter */
	#define PMC_MULB_MSK			(0x7ffu << 16)			/**< \brief (CKGR_PLLBR) PLLB Multiplier */
	#define PMC_MULB(value)			(((value)&0x7FF) << 16)	/**< \brief (CKGR_PLLBR) PLLB Multiplier */

	/* -------- PMC_MCKR : (PMC Offset: 0x0030) Master Clock Register -------- */

	#define	MCKR_SLOW_CLK	(0x0u << 0)		/**< \brief (PMC_MCKR) Slow Clock is selected */
	#define	MCKR_MAIN_CLK	(0x1u << 0)		/**< \brief (PMC_MCKR) Main Clock is selected */
	#define	MCKR_PLLA_CLK	(0x2u << 0)		/**< \brief (PMC_MCKR) PLLA Clock is selected */
	#define	MCKR_PLLB_CLK	(0x3u << 0)		/**< \brief (PMC_MCKR) PLLBClock is selected */
	#define	MCKR_PRES_1		(0x0u << 4)		/**< \brief (PMC_MCKR) Selected clock */
	#define	MCKR_PRES_2		(0x1u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 2 */
	#define	MCKR_PRES_4		(0x2u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 4 */
	#define	MCKR_PRES_8		(0x3u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 8 */
	#define	MCKR_PRES_16	(0x4u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 16 */
	#define	MCKR_PRES_32	(0x5u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 32 */
	#define	MCKR_PRES_64	(0x6u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 64 */
	#define	MCKR_PRES_3		(0x7u << 4)		/**< \brief (PMC_MCKR) Selected clock divided by 3 */
	#define	MCKR_PLLADIV2	(0x1u << 12)	/**< \brief (PMC_MCKR) PLLA Divisor by 2 */
	#define	MCKR_PLLBDIV2	(0x1u << 13)	/**< \brief (PMC_MCKR) PLLB Divisor by 2 */

	/* -------- PMC_PCK[3] : (PMC Offset: 0x0040) Programmable Clock 0 Register -------- */

	#define   PMC_PCK_SLOW_CLK	(0x0u << 0) /**< \brief (PMC_PCK[3]) Slow Clock is selected */
	#define   PMC_PCK_MAIN_CLK	(0x1u << 0) /**< \brief (PMC_PCK[3]) Main Clock is selected */
	#define   PMC_PCK_PLLA_CLK	(0x2u << 0) /**< \brief (PMC_PCK[3]) PLLA Clock is selected */
	#define   PMC_PCK_PLLB_CLK	(0x3u << 0) /**< \brief (PMC_PCK[3]) PLLB Clock is selected */
	#define   PMC_PCK_MCK		(0x4u << 0) /**< \brief (PMC_PCK[3]) Master Clock is selected */
	#define   PMC_PCK_PRES_1	(0x0u << 4) /**< \brief (PMC_PCK[3]) Selected clock */
	#define   PMC_PCK_PRES_2	(0x1u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 2 */
	#define   PMC_PCK_PRES_4	(0x2u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 4 */
	#define   PMC_PCK_PRES_8	(0x3u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 8 */
	#define   PMC_PCK_PRES_16	(0x4u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 16 */
	#define   PMC_PCK_PRES_32	(0x5u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 32 */
	#define   PMC_PCK_PRES_64	(0x6u << 4) /**< \brief (PMC_PCK[3]) Selected clock divided by 64 */

	/* -------- PMC_SCER : (PMC Offset: 0x0000) System Clock Enable Register -------- */

	#define PMC_UDP		(0x1u << 7)		/**< \brief (PMC_SCER) USB Device Port Clock Enable */
	#define PMC_PCK0	(0x1u << 8)		/**< \brief (PMC_SCER) Programmable Clock 0 Output Enable */
	#define PMC_PCK1	(0x1u << 9)		/**< \brief (PMC_SCER) Programmable Clock 1 Output Enable */
	#define PMC_PCK2	(0x1u << 10)	/**< \brief (PMC_SCER) Programmable Clock 2 Output Enable */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	//struct S_EBI
	//{
	//	AT91_REG	CSA;
	//	AT91_REG	z__reserved1[3];
	//	S_SMC		SMC;
	//};

	//S_EBI * const EBI = MK_PTR(S_EBI,0xFFFFFF80);

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_PIO
	{
		AT91_REG PER;						//	PIO_PER 								
		AT91_REG PDR;						//	PIO_PDR 
		AT91_REG PSR;						//	PIO_PSR 
		AT91_REG z__reserved1;				//	–
		AT91_REG OER;						//	PIO_OER 
		AT91_REG ODR;						//	PIO_ODR 
		AT91_REG OSR;						//	PIO_OSR 
		AT91_REG z__reserved2;				//	–
		AT91_REG IFER;						//	PIO_IFER 
		AT91_REG IFDR;						//	PIO_IFDR 
		AT91_REG IFSR;						//	PIO_IFSR 
		AT91_REG z__reserved3;				//	–
		AT91_REG SODR;						//	PIO_SODR 
		AT91_REG CODR;						//	PIO_CODR 
		AT91_REG ODSR;						//	PIO_ODSR
		AT91_REG PDSR;						//	PIO_PDSR 
		AT91_REG IER;						//	PIO_IER
		AT91_REG IDR;						//	PIO_IDR
		AT91_REG IMR;						//	PIO_IMR 
		AT91_REG ISR;						//	PIO_ISR
		AT91_REG MDER;						//	PIO_MDER 
		AT91_REG MDDR;						//	PIO_MDDR 
		AT91_REG MDSR;						//	PIO_MDSR 
		AT91_REG z__reserved4;				//	–
		AT91_REG PUDR;						//	PIO_PUDR 
		AT91_REG PUER;						//	PIO_PUER
		AT91_REG PUSR;						//	PIO_PUSR
		AT91_REG z__reserved5;				//	–
		AT91_REG ABCDSR1;					//	PIO_ABCDSR1
		AT91_REG ABCDSR2;					//	PIO_ABCDSR2
		AT91_REG z__reserved6[2];			//	–									
		AT91_REG SCIFSR;					//	PIO_IFSCDR 
		AT91_REG DIFSR;						//	PIO_IFSCER 
		AT91_REG IFDGSR;					//	PIO_IFSCSR 
		AT91_REG SCDR;						//	PIO_SCDR 
		AT91_REG PPDDR;						//	PIO_PPDDR 
		AT91_REG PPDER;						//	PIO_PPDER 
		AT91_REG PPDSR;						//	PIO_PPDSR 
		AT91_REG z__reserved7;				//	–
		AT91_REG OWER;						//	PIO_OWER 
		AT91_REG OWDR;						//	PIO_OWDR 
		AT91_REG OWSR;						//	PIO_OWSR 
		AT91_REG z__reserved8;				//	–
		AT91_REG AIMER;						//	PIO_AIMER 
		AT91_REG AIMDR;						//	PIO_AIMDR 
		AT91_REG AIMMR;						//	PIO_AIMMR 
		AT91_REG z__reserved9;				//	–
		AT91_REG ESR;						//	PIO_ESR 
		AT91_REG LSR;						//	PIO_LSR 
		AT91_REG ELSR;						//	PIO_ELSR 
		AT91_REG z__reserved10;				//	–
		AT91_REG FELLSR;					//	PIO_FELLSR 
		AT91_REG REHLSR;					//	PIO_REHLSR 
		AT91_REG FRLHSTR;					//	PIO_FRLHSR 
		AT91_REG z__reserved11;				//	–
		AT91_REG LOCKSR;					//	PIO_LOCKSR 
		AT91_REG WPMR;						//	PIO_WPMR 
		AT91_REG WPSR;						//	PIO_WPSR 
		AT91_REG z__reserved12[5];			//	–
		AT91_REG SCHMITT;					//	PIO_SCHMITT
			
		__forceinline void 	SET(u32 m) 			{ SODR = m; }
		__forceinline void 	CLR(u32 m) 			{ CODR = m; }
		__forceinline void 	NOT(u32 m) 			{ /*OUTTGL = m;*/ }
		__forceinline void 	WBIT(u32 m, bool c) { if (c) SET(m); else CLR(m); }
		__forceinline void 	BSET(u16 b) 		{ SODR = 1 << b; }
		__forceinline void 	BCLR(u16 b) 		{ CODR = 1 << b; }
		__forceinline void 	BTGL(u16 b) 		{ /*OUTTGL = 1 << b;*/ }

