Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
		//__forceinline void		OUT8(byte v)		{ *((byte*)&OUT) = v; }

		__forceinline bool 	TBSET(u16 b) 		{ return PDSR & (1<<b); }
		__forceinline bool 	TBCLR(u16 b) 		{ return (PDSR & (1<<b)) == 0; }

	};										
											
	typedef S_PIO S_PIOA, S_PIOB, S_PIOC, S_PORT;	
			
	#define PA0 	(1UL<<0)
	#define PA1 	(1UL<<1)
	#define PA2 	(1UL<<2)
	#define PA3 	(1UL<<3)
	#define PA4 	(1UL<<4)
	#define PA5 	(1UL<<5)
	#define PA6 	(1UL<<6)
	#define PA7 	(1UL<<7)
	#define PA8 	(1UL<<8)
	#define PA9 	(1UL<<9)
	#define PA00 	(1UL<<0)
	#define PA01 	(1UL<<1)
	#define PA02 	(1UL<<2)
	#define PA03 	(1UL<<3)
	#define PA04 	(1UL<<4)
	#define PA05 	(1UL<<5)
	#define PA06 	(1UL<<6)
	#define PA07 	(1UL<<7)
	#define PA08 	(1UL<<8)
	#define PA09 	(1UL<<9)
	#define PA10 	(1UL<<10)
	#define PA11 	(1UL<<11)
	#define PA12 	(1UL<<12)
	#define PA13 	(1UL<<13)
	#define PA14 	(1UL<<14)
	#define PA15 	(1UL<<15)
	#define PA16 	(1UL<<16)
	#define PA17 	(1UL<<17)
	#define PA18 	(1UL<<18)
	#define PA19 	(1UL<<19)
	#define PA20 	(1UL<<20)
	#define PA21 	(1UL<<21)
	#define PA22 	(1UL<<22)
	#define PA23 	(1UL<<23)
	#define PA24 	(1UL<<24)
	#define PA25 	(1UL<<25)
	#define PA26 	(1UL<<26)
	#define PA27 	(1UL<<27)
	#define PA28 	(1UL<<28)
	#define PA29 	(1UL<<29)
	#define PA30 	(1UL<<30)
	#define PA31 	(1UL<<31)

	#define PB0 	(1UL<<0)
	#define PB1 	(1UL<<1)
	#define PB2 	(1UL<<2)
	#define PB3 	(1UL<<3)
	#define PB4 	(1UL<<4)
	#define PB5 	(1UL<<5)
	#define PB6 	(1UL<<6)
	#define PB7 	(1UL<<7)
	#define PB8 	(1UL<<8)
	#define PB9 	(1UL<<9)
	#define PB00 	(1UL<<0)
	#define PB01 	(1UL<<1)
	#define PB02 	(1UL<<2)
	#define PB03 	(1UL<<3)
	#define PB04 	(1UL<<4)
	#define PB05 	(1UL<<5)
	#define PB06 	(1UL<<6)
	#define PB07 	(1UL<<7)
	#define PB08 	(1UL<<8)
	#define PB09 	(1UL<<9)
	#define PB10 	(1UL<<10)
	#define PB11 	(1UL<<11)
	#define PB12 	(1UL<<12)
	#define PB13 	(1UL<<13)
	#define PB14 	(1UL<<14)
	#define PB15 	(1UL<<15)
	#define PB16 	(1UL<<16)
	#define PB17 	(1UL<<17)
	#define PB18 	(1UL<<18)
	#define PB19 	(1UL<<19)
	#define PB20 	(1UL<<20)
	#define PB21 	(1UL<<21)
	#define PB22 	(1UL<<22)
	#define PB23 	(1UL<<23)
	#define PB24 	(1UL<<24)
	#define PB25 	(1UL<<25)
	#define PB26 	(1UL<<26)
	#define PB27 	(1UL<<27)
	#define PB28 	(1UL<<28)
	#define PB29 	(1UL<<29)
	#define PB30 	(1UL<<30)
	#define PB31 	(1UL<<31)

	#define PC0 	(1UL<<0)
	#define PC1 	(1UL<<1)
	#define PC2 	(1UL<<2)
	#define PC3 	(1UL<<3)
	#define PC4 	(1UL<<4)
	#define PC5 	(1UL<<5)
	#define PC6 	(1UL<<6)
	#define PC7 	(1UL<<7)
	#define PC8 	(1UL<<8)
	#define PC9 	(1UL<<9)
	#define PC00 	(1UL<<0)
	#define PC01 	(1UL<<1)
	#define PC02 	(1UL<<2)
	#define PC03 	(1UL<<3)
	#define PC04 	(1UL<<4)
	#define PC05 	(1UL<<5)
	#define PC06 	(1UL<<6)
	#define PC07 	(1UL<<7)
	#define PC08 	(1UL<<8)
	#define PC09 	(1UL<<9)
	#define PC10 	(1UL<<10)
	#define PC11 	(1UL<<11)
	#define PC12 	(1UL<<12)
	#define PC13 	(1UL<<13)
	#define PC14 	(1UL<<14)
	#define PC15 	(1UL<<15)
	#define PC16 	(1UL<<16)
	#define PC17 	(1UL<<17)
	#define PC18 	(1UL<<18)
	#define PC19 	(1UL<<19)
	#define PC20 	(1UL<<20)
	#define PC21 	(1UL<<21)
	#define PC22 	(1UL<<22)
	#define PC23 	(1UL<<23)
	#define PC24 	(1UL<<24)
	#define PC25 	(1UL<<25)
	#define PC26 	(1UL<<26)
	#define PC27 	(1UL<<27)
	#define PC28 	(1UL<<28)
	#define PC29 	(1UL<<29)
	#define PC30 	(1UL<<30)
	#define PC31 	(1UL<<31)

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_MC
	{
		AT91_REG RCR;	
		AT91_REG ASR;	
		AT91_REG AASR;	
		AT91_REG _RESERVED;	
		AT91_REG PUIA0;	
		AT91_REG PUIA1;	
		AT91_REG PUIA2;	
		AT91_REG PUIA3;	
		AT91_REG PUIA4;	
		AT91_REG PUIA5;	
		AT91_REG PUIA6;	
		AT91_REG PUIA7;	
		AT91_REG PUIA8;	
		AT91_REG PUIA9;	
		AT91_REG PUIA10;	
		AT91_REG PUIA11;	
		AT91_REG PUIA12;	
		AT91_REG PUIA13;	
		AT91_REG PUIA14;	
		AT91_REG PUIA15;	
		AT91_REG PUP;	
		AT91_REG PUER;	
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_TC
	{
		struct 
		{
			AT91_REG CCR;
			AT91_REG CMR;
			AT91_REG SMMR;
			AT91_REG z__reserved1;
			AT91_REG CV;
			AT91_REG RA;
			AT91_REG RB;
			AT91_REG RC;
			AT91_REG SR;
			AT91_REG IER;
			AT91_REG IDR;
			AT91_REG IMR;
			AT91_REG z__reserved2[4];
		} C0, C1, C2;

		AT91_REG BCR;
		AT91_REG BMR;

		AT91_REG QIER;
		AT91_REG QIDR;
		AT91_REG QIMR;
		AT91_REG QISR;
		AT91_REG FMR;
		AT91_REG WPMR;
	};

	typedef S_TC S_TC0, S_TC1;

	/* -------- TC_CCR : (TC Offset: N/A) Channel Control Register -------- */

	#define TC_CLKEN	(0x1u << 0)		/**< \brief (TC_CCR) Counter Clock Enable Command */
	#define TC_CLKDIS	(0x1u << 1)		/**< \brief (TC_CCR) Counter Clock Disable Command */
	#define TC_SWTRG	(0x1u << 2)		/**< \brief (TC_CCR) Software Trigger Command */

	/* -------- TC_CMR : (TC Offset: N/A) Channel Mode Register -------- */

	#define	TC_TCCLKS_MCK2		(0x0u << 0)		/**< \brief (TC_CMR) Clock selected: internal TIMER_CLOCK1 clock signal (from PMC) */
	#define	TC_TCCLKS_MCK8		(0x1u << 0)		/**< \brief (TC_CMR) Clock selected: internal TIMER_CLOCK2 clock signal (from PMC) */
	#define	TC_TCCLKS_MCK32		(0x2u << 0)		/**< \brief (TC_CMR) Clock selected: internal TIMER_CLOCK3 clock signal (from PMC) */
	#define	TC_TCCLKS_MCK128	(0x3u << 0)		/**< \brief (TC_CMR) Clock selected: internal TIMER_CLOCK4 clock signal (from PMC) */
	#define	TC_TCCLKS_SLCK		(0x4u << 0)		/**< \brief (TC_CMR) Clock selected: internal TIMER_CLOCK5 clock signal (from PMC) */
	#define	TC_TCCLKS_XC0		(0x5u << 0)		/**< \brief (TC_CMR) Clock selected: XC0 */
	#define	TC_TCCLKS_XC1		(0x6u << 0)		/**< \brief (TC_CMR) Clock selected: XC1 */
	#define	TC_TCCLKS_XC2		(0x7u << 0)		/**< \brief (TC_CMR) Clock selected: XC2 */

	#define TC_CLKI				(0x1u << 3)		/**< \brief (TC_CMR) Clock Invert */
	#define	TC_BURST_NONE		(0x0u << 4)		/**< \brief (TC_CMR) The clock is not gated by an external signal. */
	#define	TC_BURST_XC0		(0x1u << 4)		/**< \brief (TC_CMR) XC0 is ANDed with the selected clock. */
	#define	TC_BURST_XC1		(0x2u << 4)		/**< \brief (TC_CMR) XC1 is ANDed with the selected clock. */
	#define	TC_BURST_XC2		(0x3u << 4)		/**< \brief (TC_CMR) XC2 is ANDed with the selected clock. */
	#define TC_LDBSTOP			(0x1u << 6)		/**< \brief (TC_CMR) Counter Clock Stopped with RB Loading */
	#define TC_LDBDIS			(0x1u << 7)		/**< \brief (TC_CMR) Counter Clock Disable with RB Loading */
	#define	TC_ETRGEDG_NONE		(0x0u << 8)		/**< \brief (TC_CMR) The clock is not gated by an external signal. */
	#define	TC_ETRGEDG_RISING	(0x1u << 8)		/**< \brief (TC_CMR) Rising edge */
	#define	TC_ETRGEDG_FALLING	(0x2u << 8)		/**< \brief (TC_CMR) Falling edge */
	#define	TC_ETRGEDG_EDGE		(0x3u << 8)		/**< \brief (TC_CMR) Each edge */
	#define TC_ABETRG			(0x1u << 10)	/**< \brief (TC_CMR) TIOA or TIOB External Trigger Selection */
	#define TC_CPCTRG			(0x1u << 14)	/**< \brief (TC_CMR) RC Compare Trigger Enable */
	#define TC_WAVE				(0x1u << 15)	/**< \brief (TC_CMR) Waveform Mode */
	#define	TC_LDRA_NONE		(0x0u << 16)	/**< \brief (TC_CMR) None */
	#define	TC_LDRA_RISING		(0x1u << 16)	/**< \brief (TC_CMR) Rising edge of TIOA */
	#define	TC_LDRA_FALLING		(0x2u << 16)	/**< \brief (TC_CMR) Falling edge of TIOA */
	#define	TC_LDRA_EDGE		(0x3u << 16)	/**< \brief (TC_CMR) Each edge of TIOA */
	#define	TC_LDRB_NONE		(0x0u << 18)	/**< \brief (TC_CMR) None */
	#define	TC_LDRB_RISING		(0x1u << 18)	/**< \brief (TC_CMR) Rising edge of TIOA */
	#define	TC_LDRB_FALLING		(0x2u << 18)	/**< \brief (TC_CMR) Falling edge of TIOA */
	#define	TC_LDRB_EDGE		(0x3u << 18)	/**< \brief (TC_CMR) Each edge of TIOA */

	#define TC_CPCSTOP			(0x1u << 6)		/**< \brief (TC_CMR) Counter Clock Stopped with RC Compare */
	#define TC_CPCDIS			(0x1u << 7)		/**< \brief (TC_CMR) Counter Clock Disable with RC Compare */
	#define	TC_EEVTEDG_NONE		(0x0u << 8)		/**< \brief (TC_CMR) None */
	#define	TC_EEVTEDG_RISING	(0x1u << 8)		/**< \brief (TC_CMR) Rising edge */
	#define	TC_EEVTEDG_FALLING	(0x2u << 8)		/**< \brief (TC_CMR) Falling edge */
	#define	TC_EEVTEDG_EDGE		(0x3u << 8)		/**< \brief (TC_CMR) Each edge */
	#define	TC_EEVT_TIOB		(0x0u << 10)	/**< \brief (TC_CMR) TIOB */
	#define	TC_EEVT_XC0			(0x1u << 10)	/**< \brief (TC_CMR) XC0 */
	#define	TC_EEVT_XC1			(0x2u << 10)	/**< \brief (TC_CMR) XC1 */
	#define	TC_EEVT_XC2			(0x3u << 10)	/**< \brief (TC_CMR) XC2 */
	#define TC_ENETRG			0x1u << 12)		/**< \brief (TC_CMR) External Event Trigger Enable */
	#define	TC_WAVSEL_UP		(0x0u << 13)	/**< \brief (TC_CMR) UP mode without automatic trigger on RC Compare */
	#define	TC_WAVSEL_UPDOWN	(0x1u << 13)	/**< \brief (TC_CMR) UPDOWN mode without automatic trigger on RC Compare */
	#define	TC_WAVSEL_UP_RC		(0x2u << 13)	/**< \brief (TC_CMR) UP mode with automatic trigger on RC Compare */
	#define	TC_WAVSEL_UPDOWN_RC (0x3u << 13)	/**< \brief (TC_CMR) UPDOWN mode with automatic trigger on RC Compare */
	#define	TC_ACPA_NONE		(0x0u << 16)	/**< \brief (TC_CMR) None */
	#define	TC_ACPA_SET			(0x1u << 16)	/**< \brief (TC_CMR) Set */
	#define	TC_ACPA_CLEAR		(0x2u << 16)	/**< \brief (TC_CMR) Clear */
	#define	TC_ACPA_TOGGLE		(0x3u << 16)	/**< \brief (TC_CMR) Toggle */
	#define	TC_ACPC_NONE		(0x0u << 18)	/**< \brief (TC_CMR) None */
	#define	TC_ACPC_SET			(0x1u << 18)	/**< \brief (TC_CMR) Set */
	#define	TC_ACPC_CLEAR		(0x2u << 18)	/**< \brief (TC_CMR) Clear */
	#define	TC_ACPC_TOGGLE		(0x3u << 18)	/**< \brief (TC_CMR) Toggle */
	#define	TC_AEEVT_NONE		(0x0u << 20)	/**< \brief (TC_CMR) None */
	#define	TC_AEEVT_SET		(0x1u << 20)	/**< \brief (TC_CMR) Set */
	#define	TC_AEEVT_CLEAR		(0x2u << 20)	/**< \brief (TC_CMR) Clear */
	#define	TC_AEEVT_TOGGLE		(0x3u << 20)	/**< \brief (TC_CMR) Toggle */
	#define	TC_ASWTRG_NONE		(0x0u << 22)	/**< \brief (TC_CMR) None */
	#define	TC_ASWTRG_SET		(0x1u << 22)	/**< \brief (TC_CMR) Set */
	#define	TC_ASWTRG_CLEAR		(0x2u << 22)	/**< \brief (TC_CMR) Clear */
	#define	TC_ASWTRG_TOGGLE	(0x3u << 22)	/**< \brief (TC_CMR) Toggle */
	#define	TC_BCPB_NONE		(0x0u << 24)	/**< \brief (TC_CMR) None */
	#define	TC_BCPB_SET			(0x1u << 24)	/**< \brief (TC_CMR) Set */
	#define	TC_BCPB_CLEAR		(0x2u << 24)	/**< \brief (TC_CMR) Clear */
	#define	TC_BCPB_TOGGLE		(0x3u << 24)	/**< \brief (TC_CMR) Toggle */
	#define	TC_BCPC_NONE		(0x0u << 26)	/**< \brief (TC_CMR) None */
	#define	TC_BCPC_SET			(0x1u << 26)	/**< \brief (TC_CMR) Set */
	#define	TC_BCPC_CLEAR		(0x2u << 26)	/**< \brief (TC_CMR) Clear */
	#define	TC_BCPC_TOGGLE		(0x3u << 26)	/**< \brief (TC_CMR) Toggle */
	#define	TC_BEEVT_NONE		(0x0u << 28)	/**< \brief (TC_CMR) None */
	#define	TC_BEEVT_SET		(0x1u << 28)	/**< \brief (TC_CMR) Set */
	#define	TC_BEEVT_CLEAR		(0x2u << 28)	/**< \brief (TC_CMR) Clear */
	#define	TC_BEEVT_TOGGLE		(0x3u << 28)	/**< \brief (TC_CMR) Toggle */
	#define	TC_BSWTRG_NONE		(0x0u << 30)	/**< \brief (TC_CMR) None */
	#define	TC_BSWTRG_SET		(0x1u << 30)	/**< \brief (TC_CMR) Set */
	#define	TC_BSWTRG_CLEAR		(0x2u << 30)	/**< \brief (TC_CMR) Clear */
	#define	TC_BSWTRG_TOGGLE	(0x3u << 30)	/**< \brief (TC_CMR) Toggle */

	/* -------- TC_SMMR : (TC Offset: N/A) Stepper Motor Mode Register -------- */

	#define TC_GCEN (0x1u << 0) /**< \brief (TC_SMMR) Gray Count Enable */
	#define TC_DOWN (0x1u << 1) /**< \brief (TC_SMMR) DOWN Count */

