Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	/* -------- TC_SR : (TC Offset: N/A) Status Register -------- */

	#define TC_COVFS	(0x1u << 0)		/**< \brief (TC_SR) Counter Overflow Status */
	#define TC_LOVRS	(0x1u << 1)		/**< \brief (TC_SR) Load Overrun Status */
	#define TC_CPAS		(0x1u << 2)		/**< \brief (TC_SR) RA Compare Status */
	#define TC_CPBS		(0x1u << 3)		/**< \brief (TC_SR) RB Compare Status */
	#define TC_CPCS		(0x1u << 4)		/**< \brief (TC_SR) RC Compare Status */
	#define TC_LDRAS	(0x1u << 5)		/**< \brief (TC_SR) RA Loading Status */
	#define TC_LDRBS	(0x1u << 6)		/**< \brief (TC_SR) RB Loading Status */
	#define TC_ETRGS	(0x1u << 7)		/**< \brief (TC_SR) External Trigger Status */
	#define TC_CLKSTA	(0x1u << 16)	/**< \brief (TC_SR) Clock Enabling Status */
	#define TC_MTIOA	(0x1u << 17)	/**< \brief (TC_SR) TIOA Mirror */
	#define TC_MTIOB	(0x1u << 18)	/**< \brief (TC_SR) TIOB Mirror */

	/* -------- TC_BCR : (TC Offset: 0xC0) Block Control Register -------- */

	#define TC_SYNC (0x1u << 0) /**< \brief (TC_BCR) Synchro Command */
	
	/* -------- TC_BMR : (TC Offset: 0xC4) Block Mode Register -------- */

	#define	TC_TC0XC0S_TCLK0	(0x0u << 0)				/**< \brief (TC_BMR) Signal connected to XC0: TCLK0 */
	#define	TC_TC0XC0S_TIOA1	(0x2u << 0)				/**< \brief (TC_BMR) Signal connected to XC0: TIOA1 */
	#define	TC_TC0XC0S_TIOA2	(0x3u << 0)				/**< \brief (TC_BMR) Signal connected to XC0: TIOA2 */
	#define	TC_TC1XC1S_TCLK1	(0x0u << 2)				/**< \brief (TC_BMR) Signal connected to XC1: TCLK1 */
	#define	TC_TC1XC1S_TIOA0	(0x2u << 2)				/**< \brief (TC_BMR) Signal connected to XC1: TIOA0 */
	#define	TC_TC1XC1S_TIOA2	(0x3u << 2)				/**< \brief (TC_BMR) Signal connected to XC1: TIOA2 */
	#define	TC_TC2XC2S_TCLK2	(0x0u << 4)				/**< \brief (TC_BMR) Signal connected to XC2: TCLK2 */
	#define	TC_TC2XC2S_TIOA0	(0x2u << 4)				/**< \brief (TC_BMR) Signal connected to XC2: TIOA0 */
	#define	TC_TC2XC2S_TIOA1	(0x3u << 4)				/**< \brief (TC_BMR) Signal connected to XC2: TIOA1 */
	#define TC_QDEN				(0x1u << 8)				/**< \brief (TC_BMR) Quadrature Decoder ENabled */
	#define TC_POSEN			(0x1u << 9)				/**< \brief (TC_BMR) POSition ENabled */
	#define TC_SPEEDEN			(0x1u << 10)			/**< \brief (TC_BMR) SPEED ENabled */
	#define TC_QDTRANS			(0x1u << 11)			/**< \brief (TC_BMR) Quadrature Decoding TRANSparent */
	#define TC_EDGPHA			(0x1u << 12)			/**< \brief (TC_BMR) EDGe on PHA count mode */
	#define TC_INVA				(0x1u << 13)			/**< \brief (TC_BMR) INVerted phA */
	#define TC_INVB				(0x1u << 14)			/**< \brief (TC_BMR) INVerted phB */
	#define TC_INVIDX			(0x1u << 15)			/**< \brief (TC_BMR) INVerted InDeX */
	#define TC_SWAP				(0x1u << 16)			/**< \brief (TC_BMR) SWAP PHA and PHB */
	#define TC_IDXPHB			(0x1u << 17)			/**< \brief (TC_BMR) InDeX pin is PHB pin */
	#define TC_FILTER			(0x1u << 19)			/**< \brief (TC_BMR) Glitch Filter */
	#define TC_MAXFILT(value)	(((value)&0x3F) << 20)	/**< \brief (TC_BMR) MAXimum FILTer */

	/* -------- TC_QISR : (TC Offset: 0xD4) QDEC Interrupt Status Register -------- */

	#define TC_IDX		(0x1u << 0) /**< \brief (TC_QISR) InDeX */
	#define TC_DIRCHG	(0x1u << 1) /**< \brief (TC_QISR) DIRection CHanGe */
	#define TC_QERR		(0x1u << 2) /**< \brief (TC_QISR) Quadrature ERRor */
	#define TC_DIR		(0x1u << 8) /**< \brief (TC_QISR) DIRection */
	
	/* -------- TC_FMR : (TC Offset: 0xD8) Fault Mode Register -------- */

	#define TC_ENCF0	(0x1u << 0) /**< \brief (TC_FMR) ENable Compare Fault Channel 0 */
	#define TC_ENCF1	(0x1u << 1) /**< \brief (TC_FMR) ENable Compare Fault Channel 1 */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_PDC
	{
		AT91_PTR RPR;	// Receive Pointer Register	
		AT91_REG RCR;	// Receive Counter Register
		AT91_PTR TPR;	// Transmit Pointer Register
		AT91_REG TCR;	// Transmit Counter Register
		AT91_PTR RNPR;	// Receive Next Pointer Register	
		AT91_REG RNCR;	// Receive Next Pointer Register
		AT91_PTR TNPR;	// Transmit Next Pointer Register
		AT91_REG TNCR;	// Transmit Next Counter Register
		AT91_REG PTCR;	// PDC Transfer Control Register	
		AT91_REG PTSR;	// PDC Transfer Status Register
	};

	/* -------- PERIPH_PTCR : (PDC Offset: 0x20) Transfer Control Register -------- */

	#define PDC_RXTEN	(0x1u << 0) /**< \brief (PERIPH_PTCR) Receiver Transfer Enable */
	#define PDC_RXTDIS	(0x1u << 1) /**< \brief (PERIPH_PTCR) Receiver Transfer Disable */
	#define PDC_TXTEN	(0x1u << 8) /**< \brief (PERIPH_PTCR) Transmitter Transfer Enable */
	#define PDC_TXTDIS	(0x1u << 9) /**< \brief (PERIPH_PTCR) Transmitter Transfer Disable */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_UDP	// 0xFFFB0000
	{
		AT91_REG FRM_NUM;
		AT91_REG GLB_STAT;
		AT91_REG FADDR;
		AT91_REG z__reserved1;
		AT91_REG IER;
		AT91_REG IDR;
		AT91_REG IMR;
		AT91_REG ISR;
		AT91_REG ICR;
		AT91_REG z__reserved2;
		AT91_REG RST_EP;
		AT91_REG z__reserved3;
		AT91_REG CSR[8];
		AT91_REG FDR[8];
		AT91_REG z__reserved4;
		AT91_REG TXVC;
	};


	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_USART
	{
		AT91_REG CR;				// Control Register 	
		AT91_REG MR;				// Mode Register
		AT91_REG IER;				// Interrupt Enable Register
		AT91_REG IDR;				// Interrupt Disable Register
		AT91_REG IMR;				// Interrupt Mask Register
		AT91_REG CSR;				// Channel Status Register
		AT91_REG RHR;				// Receiver Holding Register
		AT91_REG THR;				// Transmitter Holding Register	
		AT91_REG BRGR;				// Baud Rate Generator Register
		AT91_REG RTOR;				// Receiver Time-out Register
		AT91_REG TTGR;				// Transmitter Timeguard Register
		AT91_REG z__reserved1[5];	
		AT91_REG FIDI;				// FI DI Ratio Register
		AT91_REG NER;				// Number of Errors Register
		AT91_REG z__reserved2;	
		AT91_REG IF;				// IrDA Filter Register
		AT91_REG MAN;				// Manchester Encode Decode Register
		AT91_REG z__reserved3[43];	

		S_PDC PDC;
	};

	typedef S_USART S_USART0, S_USART1;

	/* -------- US_CR : (USART Offset: 0x0000) Control Register -------- */

	#define US_RSTRX	(0x1u << 2)		/**< \brief (US_CR) Reset Receiver */
	#define US_RSTTX	(0x1u << 3)		/**< \brief (US_CR) Reset Transmitter */
	#define US_RXEN		(0x1u << 4)		/**< \brief (US_CR) Receiver Enable */
	#define US_RXDIS	(0x1u << 5)		/**< \brief (US_CR) Receiver Disable */
	#define US_TXEN		(0x1u << 6)		/**< \brief (US_CR) Transmitter Enable */
	#define US_TXDIS	(0x1u << 7)		/**< \brief (US_CR) Transmitter Disable */
	#define US_RSTSTA	(0x1u << 8)		/**< \brief (US_CR) Reset Status Bits */
	#define US_STTBRK	(0x1u << 9)		/**< \brief (US_CR) Start Break */
	#define US_STPBRK	(0x1u << 10)	/**< \brief (US_CR) Stop Break */
	#define US_STTTO	(0x1u << 11)	/**< \brief (US_CR) Start Time-out */
	#define US_SENDA	(0x1u << 12)	/**< \brief (US_CR) Send Address */
	#define US_RSTIT	(0x1u << 13)	/**< \brief (US_CR) Reset Iterations */
	#define US_RSTNACK	(0x1u << 14)	/**< \brief (US_CR) Reset Non Acknowledge */
	#define US_RETTO	(0x1u << 15)	/**< \brief (US_CR) Rearm Time-out */
	#define US_DTREN	(0x1u << 16)	/**< \brief (US_CR) Data Terminal Ready Enable */
	#define US_DTRDIS	(0x1u << 17)	/**< \brief (US_CR) Data Terminal Ready Disable */
	#define US_RTSEN	(0x1u << 18)	/**< \brief (US_CR) Request to Send Enable */
	#define US_RTSDIS	(0x1u << 19)	/**< \brief (US_CR) Request to Send Disable */
	#define US_FCS		(0x1u << 18)	/**< \brief (US_CR) Force SPI Chip Select */
	#define US_RCS		(0x1u << 19)	/**< \brief (US_CR) Release SPI Chip Select */
	
	/* -------- US_MR : (USART Offset: 0x0004) Mode Register -------- */

	#define	US_MODE_NORMAL				(0x0u << 0)		/**< \brief (US_MR) Normal mode */
	#define	US_MODE_RS485				(0x1u << 0)		/**< \brief (US_MR) RS485 */
	#define	US_MODE_HW_HANDSHAKING		(0x2u << 0)		/**< \brief (US_MR) Hardware Handshaking */
	#define	US_MODE_MODEM				(0x3u << 0)		/**< \brief (US_MR) Modem */
	#define	US_MODE_IS07816_T_0			(0x4u << 0)		/**< \brief (US_MR) IS07816 Protocol: T = 0 */
	#define	US_MODE_IS07816_T_1			(0x6u << 0)		/**< \brief (US_MR) IS07816 Protocol: T = 1 */
	#define	US_MODE_IRDA				(0x8u << 0)		/**< \brief (US_MR) IrDA */
	#define	US_MODE_SPI_MASTER			(0xEu << 0)		/**< \brief (US_MR) SPI master */
	#define	US_MODE_SPI_SLAVE			(0xFu << 0)		/**< \brief (US_MR) SPI Slave */

	#define	US_USCLKS_MCK				(0x0u << 4)		/**< \brief (US_MR) master Clock MCK is selected */
	#define	US_USCLKS_DIV				(0x1u << 4)		/**< \brief (US_MR) Internal Clock Divided MCK/DIV (DIV=8) is selected */
	#define	US_USCLKS_SCK				(0x3u << 4)		/**< \brief (US_MR) Serial Clock SLK is selected */

