Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	#define	US_CHRL_5_BIT				(0x0u << 6)		/**< \brief (US_MR) Character length is 5 bits */
	#define	US_CHRL_6_BIT				(0x1u << 6)		/**< \brief (US_MR) Character length is 6 bits */
	#define	US_CHRL_7_BIT				(0x2u << 6)		/**< \brief (US_MR) Character length is 7 bits */
	#define	US_CHRL_8_BIT				(0x3u << 6)		/**< \brief (US_MR) Character length is 8 bits */
	#define	US_SYNC						(0x1u << 8)		/**< \brief (US_MR) Synchronous Mode Select */

	#define	US_PAR_EVEN					(0x0u << 9)		/**< \brief (US_MR) Even parity */
	#define	US_PAR_ODD					(0x1u << 9)		/**< \brief (US_MR) Odd parity */
	#define	US_PAR_SPACE				(0x2u << 9)		/**< \brief (US_MR) Parity forced to 0 (Space) */
	#define	US_PAR_MARK					(0x3u << 9)		/**< \brief (US_MR) Parity forced to 1 (Mark) */
	#define	US_PAR_NO					(0x4u << 9)		/**< \brief (US_MR) No parity */
	#define	US_PAR_MULTIDROP			(0x6u << 9)		/**< \brief (US_MR) Multidrop mode */
	#define	US_NBSTOP_1_BIT				(0x0u << 12)	/**< \brief (US_MR) 1 stop bit */
	#define	US_NBSTOP_1_5_BIT			(0x1u << 12)	/**< \brief (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) */
	#define	US_NBSTOP_2_BIT				(0x2u << 12)	/**< \brief (US_MR) 2 stop bits */
	#define	US_CHMODE_NORMAL			(0x0u << 14)	/**< \brief (US_MR) Normal mode */
	#define	US_CHMODE_AUTOMATIC			(0x1u << 14)	/**< \brief (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. */
	#define	US_CHMODE_LOCAL_LOOPBACK	(0x2u << 14)	/**< \brief (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. */
	#define	US_CHMODE_REMOTE_LOOPBACK	(0x3u << 14)	/**< \brief (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. */

	#define US_MSBF						(0x1u << 16)	/**< \brief (US_MR) Bit Order */
	#define US_MODE9					(0x1u << 17)	/**< \brief (US_MR) 9-bit Character Length */
	#define US_CLKO						(0x1u << 18)	/**< \brief (US_MR) Clock Output Select */
	#define US_OVER						(0x1u << 19)	/**< \brief (US_MR) Oversampling Mode */
	#define US_INACK					(0x1u << 20)	/**< \brief (US_MR) Inhibit Non Acknowledge */
	#define US_DSNACK					(0x1u << 21)	/**< \brief (US_MR) Disable Successive NACK */
	#define US_VAR_SYNC					(0x1u << 22)	/**< \brief (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter */
	#define US_INVDATA					(0x1u << 23)	/**< \brief (US_MR) Inverted Data */
	#define US_MAX_ITERATION(value) (((value)&7) << 24)	/**< \brief (US_MR) Maximum Number of Automatic Iteration */

	#define US_FILTER					(0x1u << 28)	/**< \brief (US_MR) Infrared Receive Line Filter */
	#define US_MAN						(0x1u << 29)	/**< \brief (US_MR) Manchester Encoder/Decoder Enable */
	#define US_MODSYNC					(0x1u << 30)	/**< \brief (US_MR) Manchester Synchronization Mode */
	#define US_ONEBIT					(0x1u << 31)	/**< \brief (US_MR) Start Frame Delimiter Selector */
	#define US_CPHA						(0x1u << 8)		/**< \brief (US_MR) SPI Clock Phase */
	#define US_CPOL						(0x1u << 16)	/**< \brief (US_MR) SPI Clock Polarity */
	#define US_WRDBT					(0x1u << 20)	/**< \brief (US_MR) Wait Read Data Before Transfer */

	/* -------- US_IER : (USART Offset: 0x0008) Interrupt Enable Register -------- */

	#define US_RXRDY					(0x1u << 0)		/**< \brief (US_IER) RXRDY Interrupt Enable */
	#define US_TXRDY					(0x1u << 1)		/**< \brief (US_IER) TXRDY Interrupt Enable */
	#define US_RXBRK					(0x1u << 2)		/**< \brief (US_IER) Receiver Break Interrupt Enable */
	#define US_ENDRX					(0x1u << 3)		/**< \brief (US_IER) End of Receive Transfer Interrupt Enable (available in all USART modes of operation) */
	#define US_ENDTX					(0x1u << 4)		/**< \brief (US_IER) End of Transmit Interrupt Enable (available in all USART modes of operation) */
	#define US_OVRE						(0x1u << 5)		/**< \brief (US_IER) Overrun Error Interrupt Enable */
	#define US_FRAME					(0x1u << 6)		/**< \brief (US_IER) Framing Error Interrupt Enable */
	#define US_PARE						(0x1u << 7)		/**< \brief (US_IER) Parity Error Interrupt Enable */
	#define US_TIMEOUT					(0x1u << 8)		/**< \brief (US_IER) Time-out Interrupt Enable */
	#define US_TXEMPTY					(0x1u << 9)		/**< \brief (US_IER) TXEMPTY Interrupt Enable */
	#define US_ITER						(0x1u << 10)	/**< \brief (US_IER) Max number of Repetitions Reached Interrupt Enable */
	#define US_TXBUFE					(0x1u << 11)	/**< \brief (US_IER) Buffer Empty Interrupt Enable (available in all USART modes of operation) */
	#define US_RXBUFF					(0x1u << 12)	/**< \brief (US_IER) Buffer Full Interrupt Enable (available in all USART modes of operation) */
	#define US_NACK						(0x1u << 13)	/**< \brief (US_IER) Non AcknowledgeInterrupt Enable */
	#define US_RIIC						(0x1u << 16)	/**< \brief (US_IER) Ring Indicator Input Change Enable */
	#define US_DSRIC					(0x1u << 17)	/**< \brief (US_IER) Data Set Ready Input Change Enable */
	#define US_DCDIC					(0x1u << 18)	/**< \brief (US_IER) Data Carrier Detect Input Change Interrupt Enable */
	#define US_CTSIC					(0x1u << 19)	/**< \brief (US_IER) Clear to Send Input Change Interrupt Enable */
	#define US_MANE						(0x1u << 24)	/**< \brief (US_IER) Manchester Error Interrupt Enable */
	#define US_UNRE						(0x1u << 10)	/**< \brief (US_IER) SPI Underrun Error Interrupt Enable */


	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_UART
	{
		AT91_REG CR;	
		AT91_REG MR;	
		AT91_REG IER;	
		AT91_REG IDR;	
		AT91_REG IMR;	
		AT91_REG SR;	
		AT91_REG RHR;	
		AT91_REG THR;	
		AT91_REG BRGR;	
		AT91_REG z__reserved[55];	

		S_PDC PDC;
	};

	typedef S_UART S_UART0, S_UART1;

	/* -------- UART_CR : (UART Offset: 0x0000) Control Register -------- */

	#define UART_RSTRX	(0x1u << 2)		/**< \brief (UART_CR) Reset Receiver */
	#define UART_RSTTX	(0x1u << 3)		/**< \brief (UART_CR) Reset Transmitter */
	#define UART_RXEN	(0x1u << 4)		/**< \brief (UART_CR) Receiver Enable */
	#define UART_RXDIS	(0x1u << 5)		/**< \brief (UART_CR) Receiver Disable */
	#define UART_TXEN	(0x1u << 6)		/**< \brief (UART_CR) Transmitter Enable */
	#define UART_TXDIS	(0x1u << 7)		/**< \brief (UART_CR) Transmitter Disable */
	#define UART_RSTSTA (0x1u << 8)		/**< \brief (UART_CR) Reset Status Bits */

	/* -------- UART_MR : (UART Offset: 0x0004) Mode Register -------- */

