Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	#define   UART_PAR_EVEN					(0x0u << 9)		/**< \brief (UART_MR) Even Parity */
	#define   UART_PAR_ODD					(0x1u << 9)		/**< \brief (UART_MR) Odd Parity */
	#define   UART_PAR_SPACE				(0x2u << 9)		/**< \brief (UART_MR) Space: parity forced to 0 */
	#define   UART_PAR_MARK					(0x3u << 9)		/**< \brief (UART_MR) Mark: parity forced to 1 */
	#define   UART_PAR_NO					(0x4u << 9)		/**< \brief (UART_MR) No parity */
	#define   UART_CHMODE_NORMAL			(0x0u << 14)	/**< \brief (UART_MR) Normal mode */
	#define   UART_CHMODE_AUTOMATIC			(0x1u << 14)	/**< \brief (UART_MR) Automatic echo */
	#define   UART_CHMODE_LOCAL_LOOPBACK	(0x2u << 14)	/**< \brief (UART_MR) Local loopback */
	#define   UART_CHMODE_REMOTE_LOOPBACK	(0x3u << 14)	/**< \brief (UART_MR) Remote loopback */

	/* -------- UART_IER : (UART Offset: 0x0008) Interrupt Enable Register -------- */

	#define UART_RXRDY		(0x1u << 0) /**< \brief (UART_IER) Enable RXRDY Interrupt */
	#define UART_TXRDY		(0x1u << 1) /**< \brief (UART_IER) Enable TXRDY Interrupt */
	#define UART_ENDRX		(0x1u << 3) /**< \brief (UART_IER) Enable End of Receive Transfer Interrupt */
	#define UART_ENDTX		(0x1u << 4) /**< \brief (UART_IER) Enable End of Transmit Interrupt */
	#define UART_OVRE		(0x1u << 5) /**< \brief (UART_IER) Enable Overrun Error Interrupt */
	#define UART_FRAME		(0x1u << 6) /**< \brief (UART_IER) Enable Framing Error Interrupt */
	#define UART_PARE		(0x1u << 7) /**< \brief (UART_IER) Enable Parity Error Interrupt */
	#define UART_TXEMPTY	(0x1u << 9) /**< \brief (UART_IER) Enable TXEMPTY Interrupt */
	#define UART_TXBUFE		(0x1u << 11) /**< \brief (UART_IER) Enable Buffer Empty Interrupt */
	#define UART_RXBUFF		(0x1u << 12) /**< \brief (UART_IER) Enable Buffer Full Interrupt */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_PIT
	{
		AT91_REG		MR;
		const AT91_REG	SR;
		const AT91_REG	PIVR;
		const AT91_REG	PIIR;
	};


	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_RTT
	{
		AT91_REG		MR;
		AT91_REG		AR;
		const AT91_REG	VR;
		const AT91_REG	SR;
	};


	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_SPI
	{
		AT91_REG		CR;
		AT91_REG		MR;
		AT91_REG		RDR;
		AT91_REG		TDR;
		AT91_REG		SR;
		AT91_REG		IER;
		AT91_REG		IDR;
		AT91_REG		IMR;
		AT91_REG		z__rsrvd1[4];
		AT91_REG		CSR[4];
		AT91_REG		z__rsrvd2[41];
		AT91_REG		WPMR;
		AT91_REG		WPSR;

		AT91_REG		z__rsrvd3[5];	

		S_PDC PDC;

	};
	 
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_PWM
	{
		AT91_REG		CLK;
		AT91_REG		ENA;
		AT91_REG		DIS;
		AT91_REG		SR;
		AT91_REG		IER1;
		AT91_REG		IDR1;
		AT91_REG		IMR1;
		AT91_REG		ISR1;
		AT91_REG		SCM;

		AT91_REG		zrsrv1;

		AT91_REG		SCUC;
		AT91_REG		SCUP;
		AT91_REG		SCUPUPD;
		AT91_REG		IER2;
		AT91_REG		IDR2;
		AT91_REG		IMR2;
		AT91_REG		ISR2;
		AT91_REG		OOV;
		AT91_REG		OS;
		AT91_REG		OSS;
		AT91_REG		OSC;
		AT91_REG		OSSUPD;
		AT91_REG		OSCUPD;
		AT91_REG		FMR;
		AT91_REG		FSR;
		AT91_REG		FCR;
		AT91_REG		FPV;
		AT91_REG		FPE;

		AT91_REG		zrsrv2[3];

		AT91_REG		ELMR0;
		AT91_REG		ELMR1;

		AT91_REG		zrsrv3[11];

		AT91_REG		SMMR;

		AT91_REG		zrsrv4[12];

		AT91_REG		WPCR;
		AT91_REG		WPSR;

		AT91_REG		zrsrv5[5];

		S_PDC PDC;

		AT91_REG		zrsrv6[2];

		struct { AT91_REG VR, VUR, MR, MUR; } CMP[13];

		struct { AT91_REG	MR, DTY, DTYUPD, PRD, PRDUPD, CNT, DT, DTUPD; } CH[4];
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	/* -------- WDT_CR : (WDT Offset: 0x00) Control Register -------- */

	#define WDT_WDRSTT		(0x1u << 0)		/**< \brief (WDT_CR) Watchdog Restart */
	#define WDT_KEY_PASSWD	(0xA5u << 24)	/**< \brief (WDT_CR) Writing any other value in this field aborts the write operation. */

	/* -------- WDT_MR : (WDT Offset: 0x04) Mode Register -------- */

	#define WDT_WDV_MSK		(0xfffu << 0)			/**< \brief (WDT_MR) Watchdog Counter Value				*/
	#define WDT_WDV(value)	(((value)&0xFFF) << 0)	/**< \brief (WDT_MR) Watchdog Counter Value				*/
	#define WDT_WDFIEN		(0x1u << 12)			/**< \brief (WDT_MR) Watchdog Fault Interrupt Enable	*/
	#define WDT_WDRSTEN		(0x1u << 13)			/**< \brief (WDT_MR) Watchdog Reset Enable				*/
	#define WDT_WDRPROC		(0x1u << 14)			/**< \brief (WDT_MR) Watchdog Reset Processor			*/
	#define WDT_WDDIS		(0x1u << 15)			/**< \brief (WDT_MR) Watchdog Disable					*/
	#define WDT_WDD_MSK		(0xfffu << 16)			/**< \brief (WDT_MR) Watchdog Delta Value				*/
	#define WDT_WDD(value)	(((value)&0xFFF) << 16)	/**< \brief (WDT_MR) Watchdog Delta Value				*/
	#define WDT_WDDBGHLT	(0x1u << 28)			/**< \brief (WDT_MR) Watchdog Debug Halt				*/
	#define WDT_WDIDLEHLT	(0x1u << 29)			/**< \brief (WDT_MR) Watchdog Idle Halt					*/

	/* -------- WDT_SR : (WDT Offset: 0x08) Status Register -------- */

	#define WDT_WDUNF (0x1u << 0) /**< \brief (WDT_SR) Watchdog Underflow */
	#define WDT_WDERR (0x1u << 1) /**< \brief (WDT_SR) Watchdog Error */

	struct S_WDT
	{
		AT91_REG		CR;
		AT91_REG		MR;
		AT91_REG		SR;

		void Update()	{ CR = WDT_KEY_PASSWD|WDT_WDRSTT;	}
		void Reset()	{ CR = WDT_KEY_PASSWD|WDT_WDRSTT;	}
		void Disable()	{ MR = WDT_WDDIS;					}
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_RSTC
	{
		AT91_REG		CR;
		AT91_REG		SR;
		AT91_REG		MR;
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_ADC
	{
		AT91_REG		CR;
		AT91_REG		MR;

		AT91_REG		SEQR1;
		AT91_REG		SEQR2;

		AT91_REG		CHER;
		AT91_REG		CHDR;
		AT91_REG		CHSR;

		AT91_REG		zrsrv;

		AT91_REG		LCDR;

		AT91_REG		IER;
		AT91_REG		IDR;
		AT91_REG		IMR;
		AT91_REG		ISR;

		AT91_REG		zrsrv2[2];

		AT91_REG		OVER;
		AT91_REG		EMR;
		AT91_REG		CWR;
		AT91_REG		CGR;
		AT91_REG		COR;
		AT91_REG		CDR[16];

		AT91_REG		zrsrv3;

		AT91_REG		ACR;

		AT91_REG		zrsrv4[19];

		AT91_REG		WPMR;
		AT91_REG		WPSR;

		AT91_REG		zrsrv5[5];

		S_PDC			PDC;
	};

	/* -------- ADC_CR : (ADC Offset: 0x00) Control Register -------- */

	#define ADC_SWRST	(0x1u << 0) /**< \brief (ADC_CR) Software Reset */
	#define ADC_START	(0x1u << 1) /**< \brief (ADC_CR) Start Conversion */
	#define ADC_AUTOCAL (0x1u << 3) /**< \brief (ADC_CR) Automatic Calibration of ADC */

