Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	/* -------- ADC_MR : (ADC Offset: 0x04) Mode Register -------- */

	#define ADC_TRGEN			(0x1u << 0) /**< \brief (ADC_MR) Trigger Enable */
	#define ADC_TRGSEL_MSK		(0x7u << 1) /**< \brief (ADC_MR) Trigger Selection */
	#define	ADC_TRGSEL_EXT		(0x0u << 1) /**< \brief (ADC_MR) External trigger */
	#define	ADC_TRGSEL_TIO0		(0x1u << 1) /**< \brief (ADC_MR) TIO Output of the Timer Counter Channel 0 */
	#define	ADC_TRGSEL_TIO1		(0x2u << 1) /**< \brief (ADC_MR) TIO Output of the Timer Counter Channel 1 */
	#define	ADC_TRGSEL_TIO2		(0x3u << 1) /**< \brief (ADC_MR) TIO Output of the Timer Counter Channel 2 */
	#define	ADC_TRGSEL_PWM0		(0x4u << 1) /**< \brief (ADC_MR) PWM Event Line 0 */
	#define	ADC_TRGSEL_PWM1		(0x5u << 1) /**< \brief (ADC_MR) PWM Event Line 1 */
	#define ADC_SLEEP			(0x1u << 5) /**< \brief (ADC_MR) Sleep Mode */
	#define ADC_FWUP			(0x1u << 6) /**< \brief (ADC_MR) Fast Wake Up */
	#define ADC_FREERUN			(0x1u << 7) /**< \brief (ADC_MR) Free Run Mode */
	#define ADC_PRESCAL_MSK		(0xFFu << 8) /**< \brief (ADC_MR) Prescaler Rate Selection */
	#define ADC_PRESCAL(value)	(((value)&0xFF) << 8)
	#define ADC_STARTUP_MSK		(0xFU << 16) /**< \brief (ADC_MR) Start Up Time */
	#define	ADC_STARTUP_0		(0x0u << 16) /**< \brief (ADC_MR) 0 periods of ADCClock */
	#define	ADC_STARTUP_8		(0x1u << 16) /**< \brief (ADC_MR) 8 periods of ADCClock */
	#define	ADC_STARTUP_16		(0x2u << 16) /**< \brief (ADC_MR) 16 periods of ADCClock */
	#define	ADC_STARTUP_24		(0x3u << 16) /**< \brief (ADC_MR) 24 periods of ADCClock */
	#define	ADC_STARTUP_64		(0x4u << 16) /**< \brief (ADC_MR) 64 periods of ADCClock */
	#define	ADC_STARTUP_80		(0x5u << 16) /**< \brief (ADC_MR) 80 periods of ADCClock */
	#define	ADC_STARTUP_96		(0x6u << 16) /**< \brief (ADC_MR) 96 periods of ADCClock */
	#define	ADC_STARTUP_112		(0x7u << 16) /**< \brief (ADC_MR) 112 periods of ADCClock */
	#define	ADC_STARTUP_512		(0x8u << 16) /**< \brief (ADC_MR) 512 periods of ADCClock */
	#define	ADC_STARTUP_576		(0x9u << 16) /**< \brief (ADC_MR) 576 periods of ADCClock */
	#define	ADC_STARTUP_640		(0xAu << 16) /**< \brief (ADC_MR) 640 periods of ADCClock */
	#define	ADC_STARTUP_704		(0xBu << 16) /**< \brief (ADC_MR) 704 periods of ADCClock */
	#define	ADC_STARTUP_768		(0xCu << 16) /**< \brief (ADC_MR) 768 periods of ADCClock */
	#define	ADC_STARTUP_832		(0xDu << 16) /**< \brief (ADC_MR) 832 periods of ADCClock */
	#define	ADC_STARTUP_896		(0xEu << 16) /**< \brief (ADC_MR) 896 periods of ADCClock */
	#define	ADC_STARTUP_960		(0xFu << 16) /**< \brief (ADC_MR) 960 periods of ADCClock */
	#define ADC_SETTLING_MSK	(0x3u << 20) /**< \brief (ADC_MR) Analog Settling Time */
	#define	ADC_SETTLING_AST3	(0x0u << 20) /**< \brief (ADC_MR) 3 periods of ADCClock */
	#define	ADC_SETTLING_AST5	(0x1u << 20) /**< \brief (ADC_MR) 5 periods of ADCClock */
	#define	ADC_SETTLING_AST9	(0x2u << 20) /**< \brief (ADC_MR) 9 periods of ADCClock */
	#define	ADC_SETTLING_AST17	(0x3u << 20) /**< \brief (ADC_MR) 17 periods of ADCClock */
	#define ADC_ANACH			(0x1u << 23) /**< \brief (ADC_MR) Analog Change */
	#define ADC_TRACKTIM_MSK	(0xfu << 24) /**< \brief (ADC_MR) Tracking Time */
	#define ADC_TRACKTIM(value)	(((value)&15) << 24)
	#define ADC_TRANSFER_MSK	(0x3u << 28) /**< \brief (ADC_MR) Transfer Period */
	#define ADC_TRANSFER(value)	((value)&3 << 28)
	#define	ADC_USEQ			(0x1u << 31) /**< \brief (ADC_MR) Use Sequence Enable */
	#define	ADC_USEQ_NUM_ORDER	(0x0u << 31) /**< \brief (ADC_MR) Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index. */
	#define	ADC_USEQ_REG_ORDER	(0x1u << 31) /**< \brief (ADC_MR) User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert several times the same channel. */

	/* -------- ADC_CHER : (ADC Offset: 0x10) Channel Enable Register -------- */
	#define ADC_CH0		(0x1u << 0) /**< \brief (ADC_CHER) Channel 0 Enable */
	#define ADC_CH1		(0x1u << 1) /**< \brief (ADC_CHER) Channel 1 Enable */
	#define ADC_CH2		(0x1u << 2) /**< \brief (ADC_CHER) Channel 2 Enable */
	#define ADC_CH3		(0x1u << 3) /**< \brief (ADC_CHER) Channel 3 Enable */
	#define ADC_CH4		(0x1u << 4) /**< \brief (ADC_CHER) Channel 4 Enable */
	#define ADC_CH5		(0x1u << 5) /**< \brief (ADC_CHER) Channel 5 Enable */
	#define ADC_CH6		(0x1u << 6) /**< \brief (ADC_CHER) Channel 6 Enable */
	#define ADC_CH7		(0x1u << 7) /**< \brief (ADC_CHER) Channel 7 Enable */
	#define ADC_CH8		(0x1u << 8) /**< \brief (ADC_CHER) Channel 8 Enable */
	#define ADC_CH9		(0x1u << 9) /**< \brief (ADC_CHER) Channel 9 Enable */
	#define ADC_CH10	(0x1u << 10) /**< \brief (ADC_CHER) Channel 10 Enable */
	#define ADC_CH11	(0x1u << 11) /**< \brief (ADC_CHER) Channel 11 Enable */
	#define ADC_CH12	(0x1u << 12) /**< \brief (ADC_CHER) Channel 12 Enable */
	#define ADC_CH13	(0x1u << 13) /**< \brief (ADC_CHER) Channel 13 Enable */
	#define ADC_CH14	(0x1u << 14) /**< \brief (ADC_CHER) Channel 14 Enable */
	#define ADC_CH15	(0x1u << 15) /**< \brief (ADC_CHER) Channel 15 Enable */

	/* -------- ADC_IER : (ADC Offset: 0x24) Interrupt Enable Register -------- */
	#define ADC_EOC0	(0x1u << 0) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 0 */
	#define ADC_EOC1	(0x1u << 1) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 1 */
	#define ADC_EOC2	(0x1u << 2) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 2 */
	#define ADC_EOC3	(0x1u << 3) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 3 */
	#define ADC_EOC4	(0x1u << 4) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 4 */
	#define ADC_EOC5	(0x1u << 5) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 5 */
	#define ADC_EOC6	(0x1u << 6) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 6 */
	#define ADC_EOC7	(0x1u << 7) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 7 */
	#define ADC_EOC8	(0x1u << 8) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 8 */
	#define ADC_EOC9	(0x1u << 9) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 9 */
	#define ADC_EOC10	(0x1u << 10) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 10 */
	#define ADC_EOC11	(0x1u << 11) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 11 */
	#define ADC_EOC12	(0x1u << 12) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 12 */
	#define ADC_EOC13	(0x1u << 13) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 13 */
	#define ADC_EOC14	(0x1u << 14) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 14 */
	#define ADC_EOC15	(0x1u << 15) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 15 */
	#define ADC_EOCAL	(0x1u << 23) /**< \brief (ADC_IER) End of Calibration Sequence */
	#define ADC_DRDY	(0x1u << 24) /**< \brief (ADC_IER) Data Ready Interrupt Enable */
	#define ADC_GOVRE	(0x1u << 25) /**< \brief (ADC_IER) General Overrun Error Interrupt Enable */
	#define ADC_COMPE	(0x1u << 26) /**< \brief (ADC_IER) Comparison Event Interrupt Enable */
	#define ADC_ENDRX	(0x1u << 27) /**< \brief (ADC_IER) End of Receive Buffer Interrupt Enable */
	#define ADC_RXBUFF	(0x1u << 28) /**< \brief (ADC_IER) Receive Buffer Full Interrupt Enable */

