Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	/* -------- ADC_OVER : (ADC Offset: 0x3C) Overrun Status Register -------- */
	#define ADC_OVRE0	(0x1u << 0) /**< \brief (ADC_OVER) Overrun Error 0 */
	#define ADC_OVRE1	(0x1u << 1) /**< \brief (ADC_OVER) Overrun Error 1 */
	#define ADC_OVRE2	(0x1u << 2) /**< \brief (ADC_OVER) Overrun Error 2 */
	#define ADC_OVRE3	(0x1u << 3) /**< \brief (ADC_OVER) Overrun Error 3 */
	#define ADC_OVRE4	(0x1u << 4) /**< \brief (ADC_OVER) Overrun Error 4 */
	#define ADC_OVRE5	(0x1u << 5) /**< \brief (ADC_OVER) Overrun Error 5 */
	#define ADC_OVRE6	(0x1u << 6) /**< \brief (ADC_OVER) Overrun Error 6 */
	#define ADC_OVRE7	(0x1u << 7) /**< \brief (ADC_OVER) Overrun Error 7 */
	#define ADC_OVRE8	(0x1u << 8) /**< \brief (ADC_OVER) Overrun Error 8 */
	#define ADC_OVRE9	(0x1u << 9) /**< \brief (ADC_OVER) Overrun Error 9 */
	#define ADC_OVRE10	(0x1u << 10) /**< \brief (ADC_OVER) Overrun Error 10 */
	#define ADC_OVRE11	(0x1u << 11) /**< \brief (ADC_OVER) Overrun Error 11 */
	#define ADC_OVRE12	(0x1u << 12) /**< \brief (ADC_OVER) Overrun Error 12 */
	#define ADC_OVRE13	(0x1u << 13) /**< \brief (ADC_OVER) Overrun Error 13 */
	#define ADC_OVRE14	(0x1u << 14) /**< \brief (ADC_OVER) Overrun Error 14 */
	#define ADC_OVRE15	(0x1u << 15) /**< \brief (ADC_OVER) Overrun Error 15 */

	/* -------- ADC_ACR : (ADC Offset: 0x94) Analog Control Register -------- */
	#define ADC_TSON			(0x1u << 4) /**< \brief (ADC_ACR) Temperature Sensor On */
	#define ADC_IBCTL_MSK		(0x3u << 8) /**< \brief (ADC_ACR) ADC Bias Current Control */
	#define ADC_IBCTL(value)	(((value)&3) << 8)

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_RTC
	{
		AT91_REG		CR;
		AT91_REG		MR;
		AT91_REG		TIMR;
		AT91_REG		CALR;
		AT91_REG		TIMALR;
		AT91_REG		CALALR;
		AT91_REG		SR;
		AT91_REG		SCCR;
		AT91_REG		IER;
		AT91_REG		IDR;
		AT91_REG		IMR;
		AT91_REG		VER;
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_MATRIX
	{
		AT91_REG		MCFG[16];
		AT91_REG		SCFG[16];
		struct { AT91_REG A; AT91_REG B; } PRAS[18];
		AT91_REG		zreserve;
		AT91_REG		SYSIO;
		AT91_REG		zreserve1;
		AT91_REG		SMCNFCS;
	};

	/* -------- CCFG_SYSIO : (MATRIX Offset: 0x0114) System I/O Configuration register -------- */
	#define MATRIX_PB4	(0x1u << 4)		/**< \brief (CCFG_SYSIO) PB4 or TDI Assignment */
	#define MATRIX_PB5	(0x1u << 5)		/**< \brief (CCFG_SYSIO) PB5 or TDO/TRACESWO Assignment */
	#define MATRIX_PB6	(0x1u << 6)		/**< \brief (CCFG_SYSIO) PB6 or TMS/SWDIO Assignment */
	#define MATRIX_PB7	(0x1u << 7)		/**< \brief (CCFG_SYSIO) PB7 or TCK/SWCLK Assignment */
	#define MATRIX_PB10	(0x1u << 10)	/**< \brief (CCFG_SYSIO) PB10 or DDM Assignment */
	#define MATRIX_PB11	(0x1u << 11)	/**< \brief (CCFG_SYSIO) PB11 or DDP Assignment */
	#define MATRIX_PB12	(0x1u << 12)	/**< \brief (CCFG_SYSIO) PB12 or ERASE Assignment */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_EFC
	{
		AT91_REG		FMR;
		AT91_REG		FCR;
		AT91_REG		FSR;
		AT91_REG		FRR;
	};

	typedef S_EFC S_EFC0, S_EFC1;

	/* -------- EEFC_FMR : (EFC Offset: 0x00) EEFC Flash Mode Register -------- */
	#define EFC_FRDY		(0x1u << 0) /**< \brief (EEFC_FMR) Ready Interrupt Enable */
	#define EFC_FWS_MSK		(0xfu << 8) /**< \brief (EEFC_FMR) Flash Wait State */
	#define EFC_FWS(value)	(((value)&15) << 8)
	#define EFC_SCOD		(0x1u << 16) /**< \brief (EEFC_FMR) Sequential Code Optimization Disable */
	#define EFC_FAM			(0x1u << 24) /**< \brief (EEFC_FMR) Flash Access Mode */
	#define EFC_CLOE		(0x1u << 26) /**< \brief (EEFC_FMR) Code Loop Optimization Enable */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_SUPC
	{
		AT91_REG		CR;
		AT91_REG		SMMR;
		AT91_REG		MR;
		AT91_REG		WUMR;
		AT91_REG		WUIR;
		AT91_REG		SR;
	};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	//struct S_DMAC
	//{
	//	AT91_REG		GCFG;
	//	AT91_REG		EN;
	//	AT91_REG		SREQ;
	//	AT91_REG		CREQ;
	//	AT91_REG		LAST;
	//	AT91_REG		z__rsrvd1;
	//	AT91_REG		EBCIER;
	//	AT91_REG		EBCIDR;
	//	AT91_REG		EBCIMR;
	//	AT91_REG		EBCISR;
	//	AT91_REG		CHER;
	//	AT91_REG		CHDR;
	//	AT91_REG		CHSR;
	//	AT91_REG		z__rsrvd2[2];

	//	struct { AT91_PTR SADDR, DADDR, DSCR; AT91_REG CTRLA, CTRLB, CFG, z__rsrvd[4]; } CH[6];

	//	AT91_REG		z__rsrvd3[46];

	//	AT91_REG		WPMR;
	//	AT91_REG		WPSR;
	//};

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_CMCC
	{
		AT91_REG		TYPE;
		AT91_REG		CFG;
		AT91_REG		CTRL;
		AT91_REG		SR;
		AT91_REG		z__rsrvd[4];
		AT91_REG		MAINT0;
		AT91_REG		MAINT1;
		AT91_REG		MCFG;
		AT91_REG		MEN;
		AT91_REG		MCTRL;
		AT91_REG		MSR;
	};

	/* -------- CMCC_CFG : (CMCC Offset: 0x04) Cache Configuration Register -------- */

	#define CMCC_GCLKDIS (0x1u << 0) /**< \brief (CMCC_CFG) Disable Clock Gating */

	/* -------- CMCC_CTRL : (CMCC Offset: 0x08) Cache Control Register -------- */

	#define CMCC_CEN (0x1u << 0) /**< \brief (CMCC_CTRL) Cache Controller Enable */

	/* -------- CMCC_SR : (CMCC Offset: 0x0C) Cache Status Register -------- */

	#define CMCC_CSTS (0x1u << 0) /**< \brief (CMCC_SR) Cache Controller Status */

	/* -------- CMCC_MAINT0 : (CMCC Offset: 0x20) Cache Maintenance Register 0 -------- */

	#define CMCC_INVALL (0x1u << 0) /**< \brief (CMCC_MAINT0) Cache Controller Invalidate All */

	/* -------- CMCC_MAINT1 : (CMCC Offset: 0x24) Cache Maintenance Register 1 -------- */

	#define CMCC_INDEX(value)	(((value)&0x1F) << 4)	/**< \brief (CMCC_MAINT1) Invalidate Index */
	#define	CMCC_WAY0			(0x0u << 30) /**< \brief (CMCC_MAINT1) Way 0 is selection for index invalidation */
	#define	CMCC_WAY1			(0x1u << 30) /**< \brief (CMCC_MAINT1) Way 1 is selection for index invalidation */
	#define	CMCC_WAY2			(0x2u << 30) /**< \brief (CMCC_MAINT1) Way 2 is selection for index invalidation */
	#define	CMCC_WAY3			(0x3u << 30) /**< \brief (CMCC_MAINT1) Way 3 is selection for index invalidation */

	/* -------- CMCC_MCFG : (CMCC Offset: 0x28) Cache Monitor Configuration Register -------- */

	#define   CMCC_MODE_CYCLE_COUNT	(0x0u << 0) /**< \brief (CMCC_MCFG) Cycle counter */
	#define   CMCC_MODE_IHIT_COUNT	(0x1u << 0) /**< \brief (CMCC_MCFG) Instruction hit counter */
	#define   CMCC_MODE_DHIT_COUNT	(0x2u << 0) /**< \brief (CMCC_MCFG) Data hit counter */

	/* -------- CMCC_MEN : (CMCC Offset: 0x2C) Cache Monitor Enable Register -------- */

	#define CMCC_MENABLE (0x1u << 0) /**< \brief (CMCC_MEN) Cache Controller Monitor Enable */
	
