Kurkulon/G_LIBS/cpp/ARM/sam4sa.h
	/* -------- CMCC_MCTRL : (CMCC Offset: 0x30) Cache Monitor Control Register -------- */

	#define CMCC_SWRST (0x1u << 0) /**< \brief (CMCC_MCTRL) Monitor */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_TWI
	{
		AT91_REG		CR;
		AT91_REG		MMR;
		AT91_REG		SMR;
		AT91_REG		IADR;
		AT91_REG		CWGR;
		AT91_REG		zreserve[3];
		AT91_REG		SR;
		AT91_REG		IER;
		AT91_REG		IDR;
		AT91_REG		IMR;
		AT91_REG		RHR;
		AT91_REG		THR;
		AT91_REG		zreserve1[50];
		S_PDC			PDC;
	};

	typedef S_TWI S_TWI0, S_TWI1;

	/* -------- TWI_CR : (TWI Offset: 0x00) Control Register -------- */
	#define TWI_START				(0x1u << 0)					/**< \brief (TWI_CR) Send a START Condition */
	#define TWI_STOP				(0x1u << 1)					/**< \brief (TWI_CR) Send a STOP Condition */
	#define TWI_MSEN				(0x1u << 2)					/**< \brief (TWI_CR) TWI Master Mode Enabled */
	#define TWI_MSDIS				(0x1u << 3)					/**< \brief (TWI_CR) TWI Master Mode Disabled */
	#define TWI_SVEN				(0x1u << 4)					/**< \brief (TWI_CR) TWI Slave Mode Enabled */
	#define TWI_SVDIS				(0x1u << 5)					/**< \brief (TWI_CR) TWI Slave Mode Disabled */
	#define TWI_QUICK				(0x1u << 6)					/**< \brief (TWI_CR) SMBUS Quick Command */
	#define TWI_SWRST				(0x1u << 7)					/**< \brief (TWI_CR) Software Reset */
	/* -------- TWI_MMR : (TWI Offset: 0x04) Master Mode Register -------- */
	#define TWI_IADRSZ(v)			(((v)&3) << 8)				/**< \brief (TWI_MMR) Internal Device Address Size */
	#define	TWI_IADRSZ_NONE			(0x0u << 8)					/**< \brief (TWI_MMR) No internal device address */
	#define	TWI_IADRSZ_1_BYTE		(0x1u << 8)					/**< \brief (TWI_MMR) One-byte internal device address */
	#define	TWI_IADRSZ_2_BYTE		(0x2u << 8)					/**< \brief (TWI_MMR) Two-byte internal device address */
	#define	TWI_IADRSZ_3_BYTE		(0x3u << 8)					/**< \brief (TWI_MMR) Three-byte internal device address */
	#define TWI_MREAD				(0x1u << 12)				/**< \brief (TWI_MMR) Master Read Direction */
	#define TWI_DADR(value)			(((value)&0x7F) << 16)		/**< \brief (TWI_MMR) Device Address */
	/* -------- TWI_SMR : (TWI Offset: 0x08) Slave Mode Register -------- */
	#define TWI_SADR(value)			(((value)&0x7F) << 16)		/**< \brief (TWI_SMR) Slave Address */
	/* -------- TWI_IADR : (TWI Offset: 0x0C) Internal Address Register -------- */
	#define TWI_IADR(value)			(((value)&0XFFFFFF) << 0)	/**< \brief (TWI_IADR) Internal Address */
	/* -------- TWI_CWGR : (TWI Offset: 0x10) Clock Waveform Generator Register -------- */
	#define TWI_CWGR_CLDIV(value)	(((value)&0xFF) << 0)		/**< \brief (TWI_CWGR) Clock Low Divider */
	#define TWI_CWGR_CHDIV(value)	(((value)&0xFF) << 8)		/**< \brief (TWI_CWGR) Clock High Divider */
	#define TWI_CWGR_CKDIV(value)	(((value)&7) << 16)			/**< \brief (TWI_CWGR) Clock Divider */
	/* -------- TWI_SR : (TWI Offset: 0x20) Status Register -------- */
	#define TWI_TXCOMP				(0x1u << 0)					/**< \brief (TWI_SR) Transmission Completed (automatically set / reset) */
	#define TWI_RXRDY				(0x1u << 1)					/**< \brief (TWI_SR) Receive Holding Register Ready (automatically set / reset) */
	#define TWI_TXRDY				(0x1u << 2)					/**< \brief (TWI_SR) Transmit Holding Register Ready (automatically set / reset) */
	#define TWI_SVREAD				(0x1u << 3)					/**< \brief (TWI_SR) Slave Read (automatically set / reset) */
	#define TWI_SVACC				(0x1u << 4)					/**< \brief (TWI_SR) Slave Access (automatically set / reset) */
	#define TWI_GACC				(0x1u << 5)					/**< \brief (TWI_SR) General Call Access (clear on read) */
	#define TWI_OVRE				(0x1u << 6)					/**< \brief (TWI_SR) Overrun Error (clear on read) */
	#define TWI_NACK				(0x1u << 8)					/**< \brief (TWI_SR) Not Acknowledged (clear on read) */
	#define TWI_ARBLST				(0x1u << 9)					/**< \brief (TWI_SR) Arbitration Lost (clear on read) */
	#define TWI_SCLWS				(0x1u << 10)				/**< \brief (TWI_SR) Clock Wait State (automatically set / reset) */
	#define TWI_EOSACC				(0x1u << 11)				/**< \brief (TWI_SR) End Of Slave Access (clear on read) */
	#define TWI_ENDRX				(0x1u << 12)				/**< \brief (TWI_SR) End of RX buffer */
	#define TWI_ENDTX				(0x1u << 13)				/**< \brief (TWI_SR) End of TX buffer */
	#define TWI_RXBUFF				(0x1u << 14)				/**< \brief (TWI_SR) RX Buffer Full */
	#define TWI_TXBUFE				(0x1u << 15)				/**< \brief (TWI_SR) TX Buffer Empty */

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	union USIC
	{
		S_USART		usart;
		S_UART		uart;
		S_SPI		spi;
		S_TWI		i2c;

		//USIC()				: usart(0)	{}
		//USIC(S_USART *p)	: usart(p)	{}
		//USIC(S_UART *p)		: uart(p)	{}
		//USIC(S_SPI *p)		: spi(p)	{}
		//USIC(S_TWI *p)		: i2c(p)	{}
	};

	typedef USIC S_USIC0, S_USIC1, S_USIC2, S_USIC3, S_USIC4, S_USIC5, S_USIC6;

	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	struct S_CRCCU
	{
		AT91_PTR DSCR;		/**< \brief (Crccu Offset: 0x000) CRCCU Descriptor Base Register */
		AT91_REG			z__Reserved1[1];
		AT91_REG DMA_EN;	/**< \brief (Crccu Offset: 0x008) CRCCU DMA Enable Register */
		AT91_REG DMA_DIS;	/**< \brief (Crccu Offset: 0x00C) CRCCU DMA Disable Register */
		AT91_REG DMA_SR;	/**< \brief (Crccu Offset: 0x010) CRCCU DMA Status Register */
		AT91_REG DMA_IER;	/**< \brief (Crccu Offset: 0x014) CRCCU DMA Interrupt Enable Register */
		AT91_REG DMA_IDR;	/**< \brief (Crccu Offset: 0x018) CRCCU DMA Interrupt Disable Register */
		AT91_REG DMA_IMR;	/**< \brief (Crccu Offset: 0x001C) CRCCU DMA Interrupt Mask Register */
		AT91_REG DMA_ISR;	/**< \brief (Crccu Offset: 0x020) CRCCU DMA Interrupt Status Register */
		AT91_REG			z__Reserved2[4];
		AT91_REG CR;		/**< \brief (Crccu Offset: 0x034) CRCCU Control Register */
		AT91_REG MR;		/**< \brief (Crccu Offset: 0x038) CRCCU Mode Register */
		AT91_REG SR;		/**< \brief (Crccu Offset: 0x03C) CRCCU Status Register */
		AT91_REG IER;		/**< \brief (Crccu Offset: 0x040) CRCCU Interrupt Enable Register */
		AT91_REG IDR;		/**< \brief (Crccu Offset: 0x044) CRCCU Interrupt Disable Register */
		AT91_REG IMR;		/**< \brief (Crccu Offset: 0x048) CRCCU Interrupt Mask Register */
		AT91_REG ISR;		/**< \brief (Crccu Offset: 0x004C) CRCCU Interrupt Status Register */

		struct TRDSCR
		{
			const void*		ADDR;
			u32				CTRL;
			u32				z__Reserved[2];
			u32				CRC;
		};
	};

	#define CRCCU_DMAEN		(0x1u << 0)		/**< \brief (CRCCU_DMA_EN)	DMA Enable Register */
	#define CRCCU_DMADIS	(0x1u << 0)		/**< \brief (CRCCU_DMA_DIS) DMA Disable Register */
	#define CRCCU_DMASR		(0x1u << 0)		/**< \brief (CRCCU_DMA_SR)	DMA Status Register */
	#define CRCCU_DMAIER	(0x1u << 0)		/**< \brief (CRCCU_DMA_IER) Interrupt Enable register */
	#define CRCCU_DMAIDR	(0x1u << 0)		/**< \brief (CRCCU_DMA_IDR) Interrupt Disable register */
	#define CRCCU_DMAIMR	(0x1u << 0)		/**< \brief (CRCCU_DMA_IMR) Interrupt Mask Register */
	#define CRCCU_DMAISR	(0x1u << 0)		/**< \brief (CRCCU_DMA_ISR) Interrupt Status register */
	#define CRCCU_RESET		(0x1u << 0)		/**< \brief (CRCCU_CR) CRC	Computation Reset */

	/* -------- CRCCU_MR : (CRCCU Offset: 0x038) CRCCU Mode Register -------- */
	#define CRCCU_ENABLE			(0x1u << 0) /**< \brief (CRCCU_MR) CRC Enable */
	#define CRCCU_COMPARE			(0x1u << 1) /**< \brief (CRCCU_MR) CRC Compare */
	#define	CRCCU_CCITT8023			(0x0u << 2) /**< \brief (CRCCU_MR) Polynom 0x04C11DB7 */
	#define	CRCCU_CASTAGNOLI		(0x1u << 2) /**< \brief (CRCCU_MR) Polynom 0x1EDC6F41 */
	#define	CRCCU_CCITT16			(0x2u << 2) /**< \brief (CRCCU_MR) Polynom 0x1021 */
	#define CRCCU_MR_DIVIDER_MSK	(0xfu << 4) /**< \brief (CRCCU_MR) Request Divider */
	#define CRCCU_MR_DIVIDER(value) (((value)&15) << 4)

	#define CRCCU_ERRIER			(0x1u << 0) /**< \brief (CRCCU_IER) CRC Error Interrupt Enable */
	#define CRCCU_ERRIDR			(0x1u << 0) /**< \brief (CRCCU_IDR) CRC Error Interrupt Disable */
	#define CRCCU_ERRIMR			(0x1u << 0) /**< \brief (CRCCU_IMR) CRC Error Interrupt Mask */
	#define CRCCU_ERRISR			(0x1u << 0) /**< \brief (CRCCU_ISR) CRC Error Interrupt Status */

